# https://github.com/Homebrew/homebrew-bundle
# specify a directory to install
cask_args appdir: '/Applications'
# install packages
tap 'caskroom/homebrew-cask' || true
brew 'git'
brew 'bash-completion'
brew 'tree'
brew 'node'
tap 'neovim/neovim' || true
brew 'neovim'
# need to install java before jenkins
cask 'java'
brew 'jenkins'
brew 'wget'
# Casks
cask 'google-chrome'
cask 'dropbox'
cask 'alfred'
cask 'evernote'
cask 'flux'
cask 'skype'
cask 'virtualbox'
cask 'slack'
cask 'spotify'
cask 'kindle'
cask '1password'
cask 'iterm2'
cask 'calibre'
cask 'dash'
# for react native to run the facebook F8 app
# https://github.com/fbsamples/f8app
brew 'watchman' # https://facebook.github.io/watchman/docs/install.html 
brew 'flow' # http://www.flowtype.org/ 
brew 'mongodb' # https://www.mongodb.org/downloads#production

